Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
  };

  // End Define Variable

  if (DEBUG_MODE)
  {
	  	HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 1000);

	    result = mlp_forward_pass(debug_array[0], debug_array[1], debug_array[2], debug_array[3], debug_array[4], debug_array[5], debug_array[6], debug_array[7],debug_array[8]);

	    for (int i = 0; i < (sizeof(debug_ticket) / sizeof(debug_ticket[0])); i++)
	    {
	    	if (isalpha((unsigned)debug_ticket[i][0]))
	    	{
	    		strcpy(input_train_type, "TRA");
	    		if (debug_ticket[i][0] == 'A')  strcpy(input_train_kind, "Local");
	    		if (debug_ticket[i][0] == 'N')  strcpy(input_train_kind, "T.C.Exp.");
	    		strncpy(input_dept_sta, debug_ticket[i] + 19, 4);
	    		strncpy(input_arr_sta, debug_ticket[i] + 23, 4);
	    	}

	    	else
	    	{
	    		strcpy(input_train_type, "THSR");
	    		strcpy(input_train_kind, "Standard");
	    		strncpy(input_train_num, debug_ticket[i] + 24 , 4); // Train number
	    		strncpy(input_dept_sta, debug_ticket[i] + 29, 2);   // Departure station code
	    		input_dept_sta[2] = '\0';
	    		//input_dept_sta = sta_code_decoder(dept_sta_code);
	    		char raw_date[9] = {0};
	    		strncpy(raw_date, debug_ticket[i] + 31, 8);      // Date
	    		input_date[0] = raw_date[0];
	    		input_date[1] = raw_date[1];
	    		input_date[2] = raw_date[2];
	    		input_date[3] = raw_date[3];
	    		input_date[4] = '-';
	    		input_date[5] = raw_date[4];
	    		input_date[6] = raw_date[5];
	    		input_date[7] = '-';
	    		input_date[8] = raw_date[6];
	    		input_date[9] = raw_date[7];
	    		input_date[10] = '\0';

	    		strncpy(input_dept_time, debug_ticket[i] + 39, 4); // Departure time
	    		strncpy(input_arr_sta, debug_ticket[i] + 46, 2);    // Arrival station code
	    		input_arr_sta[2] = '\0';
	    		strncpy(input_arr_time, debug_ticket[i] + 56, 4);  // Arrival time
	    		strncpy(input_car, debug_ticket[i] + 76, 2);       // Car
	    		strncpy(input_seat, debug_ticket[i] + 79, 5);      // Seat
	    		strncpy(input_arr_sta, debug_ticket[i] + 90, 1);    // Price
	    	}

	    	//(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time, char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
	    	epd_ticket_handler(input_train_type, input_train_kind, input_train_num, input_date, input_dept_time, input_dept_sta,
	    			input_arr_time, input_arr_sta, input_car, input_seat, input_price);
	    	//debug_disp();
	    	HAL_Delay(1000);
	    }
  }

  else if (!DEBUG_MODE)
  {
	  HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	  HAL_Delay(100);
	  SSD1680_Clear(&hepd, ColorWhite);
	  SSD1680_DrawBitmap(&hepd, 0, 0, startupv, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(2000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, einvoicev, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, easycardv, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, exhomescreen, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, extra, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(1000);
	  SSD1680_DrawBitmap(&hepd, 0, 0, exthsr, 152, 296);
	  SSD1680_Refresh(&hepd, REFRESH_MODE);
	  HAL_Delay(3000);
	  HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
  }

  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 60;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 5;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief SPI1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_SPI1_Init(void)
{

  /* USER CODE BEGIN SPI1_Init 0 */

  /* USER CODE END SPI1_Init 0 */

  /* USER CODE BEGIN SPI1_Init 1 */

  /* USER CODE END SPI1_Init 1 */
  /* SPI1 parameter configuration*/
  hspi1.Instance = SPI1;
  hspi1.Init.Mode = SPI_MODE_MASTER;
  hspi1.Init.Direction = SPI_DIRECTION_2LINES_TXONLY;
  hspi1.Init.DataSize = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity = SPI_POLARITY_LOW;
  hspi1.Init.CLKPhase = SPI_PHASE_1EDGE;
  hspi1.Init.NSS = SPI_NSS_SOFT;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_128;
  hspi1.Init.FirstBit = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode = SPI_TIMODE_DISABLE;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
  hspi1.Init.CRCPolynomial = 0x0;
  hspi1.Init.NSSPMode = SPI_NSS_PULSE_ENABLE;
  hspi1.Init.NSSPolarity = SPI_NSS_POLARITY_LOW;
  hspi1.Init.FifoThreshold = SPI_FIFO_THRESHOLD_01DATA;
  hspi1.Init.TxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
  hspi1.Init.RxCRCInitializationPattern = SPI_CRC_INITIALIZATION_ALL_ZERO_PATTERN;
  hspi1.Init.MasterSSIdleness = SPI_MASTER_SS_IDLENESS_00CYCLE;
  hspi1.Init.MasterInterDataIdleness = SPI_MASTER_INTERDATA_IDLENESS_00CYCLE;
  hspi1.Init.MasterReceiverAutoSusp = SPI_MASTER_RX_AUTOSUSP_DISABLE;
  hspi1.Init.MasterKeepIOState = SPI_MASTER_KEEP_IO_STATE_DISABLE;
  hspi1.Init.IOSwap = SPI_IO_SWAP_DISABLE;
  if (HAL_SPI_Init(&hspi1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN SPI1_Init 2 */

  /* USER CODE END SPI1_Init 2 */

