Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
		// 清空舊數據
		wf_idx = 0;
		wifi_count = 0;
		memset(WFBuffer, 0, WIFI_BUF_SIZE);
		memset(wifi_list, 0, sizeof(wifi_list));

		// 發送掃描指令
		uint8_t cmd[] = "AT+CWLAP\r\n";
		HAL_UART_Transmit(&huart5, cmd, sizeof(cmd)-1, 100);

		HAL_GPIO_TogglePin(WF_LED_GPIO_Port, WF_LED_Pin);
	}
}

void parse_gpgga(uint8_t *line)
{
	if (strncmp((const char *)line, "$GPGGA", 6) != 0 && strncmp((const char *)line, "$GNGGA", 6) != 0)
    {
        return;
    }

    int i = 0;
    char *token = strtok((char *)line, ",");

    while (token != NULL && i < 15) {
        size_t len = strlen(token);
        if (len > 15) len = 15;
        memcpy(parts[i], token, len);
        parts[i][len] = '\0';
        i++;
        token = strtok(NULL, ",");
    }
    if (i < 10)
    {
        return;
    }

    if (strlen(parts[6]) == 0 || parts[6][0] == '0')
    {
        return;
    }

    if (strlen(parts[2]) == 0) return;
    float rawLat = atof(parts[2]);
    if (rawLat == 0.0) return;

    int latDeg = (int)(rawLat / 100);
    float latMin = rawLat - latDeg * 100.0;
    float lat = latDeg + latMin / 60.0;

    if (strlen(parts[3]) > 0 && parts[3][0] == 'S')
    {
        lat = -lat;
    }

    if (strlen(parts[4]) == 0) return;
    float rawLon = atof(parts[4]);
    if (rawLon == 0.0) return;

    int lonDeg = (int)(rawLon / 100);
    float lonMin = rawLon - lonDeg * 100.0;
    float lon = lonDeg + lonMin / 60.0;

    if (strlen(parts[5]) > 0 && parts[5][0] == 'W') {
        lon = -lon;
    }

    float alt = (strlen(parts[9]) > 0) ? atof(parts[9]) : 0.0;

    int satellites = (strlen(parts[7]) > 0) ? atoi(parts[7]) : 0;

    float rawTime = (strlen(parts[1]) > 0) ? atof(parts[1]) : 0.0;
    uint8_t hour = ((int)rawTime / 10000) % 24;
    uint8_t minute = ((int)rawTime / 100) % 100;
    uint8_t second = (int)rawTime % 100;

    #if DEBUG_MODE
		char debug_msg[64];
		int len = snprintf(debug_msg, sizeof(debug_msg), "Lat:%.6f Lon:%.6f Alt:%.1fm Sat:%d\n%02d:%02d:%02d UTC\n", lat, lon, alt, satellites, hour, minute, second);

		if (len > 0 && len < sizeof(debug_msg))
		{
			HAL_UART_Transmit(&huart2, (uint8_t*)debug_msg, len, 1000);
		}
    #endif
}

void Handle_BT_Command(char* cmd)
{
    #if DEBUG_MODE
        char msg[64];
        int len = snprintf(msg, sizeof(msg), "\r\n[CMD] %s\r\n", cmd);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
    #endif
}

void HM10_Process(uint8_t byte)
{
    // Debug: 顯示接收到的字符
    #if DEBUG_MODE
        HAL_UART_Transmit(&huart2, &byte, 1, 10);
    #endif

    // 加入緩衝區
    if (bt_idx < BT_BUF_SIZE - 1)
    {
        btrecv[bt_idx++] = byte;
        btrecv[bt_idx] = '\0';
    }
    else
    {
        // 滿了就重置
        bt_idx = 0;
        btrecv[0] = byte;
        btrecv[1] = '\0';
        bt_idx = 1;
    }

    // 檢查是否包含關鍵字（滑動窗口檢查）
    // 只檢查最後收到的部分

    // 方法：檢查緩衝區中是否出現 "CONN" 或 "LOST"
    if (strstr(btrecv, "CONN") != NULL)
    {
        // 連接成功
        HAL_GPIO_WritePin(BT_BLED_GPIO_Port, BT_BLED_Pin, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(BT_RLED_GPIO_Port, BT_RLED_Pin, GPIO_PIN_SET);

        #if DEBUG_MODE
            uint8_t msg[] = "\r\n[BT] Connected\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif

        // 清空
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }
    else if (strstr(btrecv, "LOST") != NULL)
    {
        // 連接斷開
        HAL_GPIO_WritePin(BT_BLED_GPIO_Port, BT_BLED_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(BT_RLED_GPIO_Port, BT_RLED_Pin, GPIO_PIN_RESET);

        #if DEBUG_MODE
            uint8_t msg[] = "\r\n[BT] Disconnected\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif

        // 清空
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }

    // 處理用戶指令（換行結束）
    if (byte == '\n' || byte == '\r')
    {
        if (bt_idx > 1 && strstr(btrecv, "OK") == NULL)
        {
            // 不是 HM-10 狀態訊息，是用戶指令
            // 移除換行符
            while (bt_idx > 0 && (btrecv[bt_idx-1] == '\r' || btrecv[bt_idx-1] == '\n'))
            {
                btrecv[--bt_idx] = '\0';
            }

            if (bt_idx > 0)
            {
                Handle_BT_Command(btrecv);
            }
        }

        // 清空緩衝區
        bt_idx = 0;
        memset(btrecv, 0, BT_BUF_SIZE);
    }
}

void Parse_WiFi_Line(char* line)
{
    // 格式: +CWLAP:(3,"2F_Office_2.4G",-57,"58:11:22:61:d6:80",1,-29,0,4,4,7,1)
    //              ↑   ↑               ↑
    //              加密 SSID            RSSI

    char* ssid_start = strchr(line, '"');
    if (!ssid_start) return;
    ssid_start++; // 跳過第一個 "

    char* ssid_end = strchr(ssid_start, '"');
    if (!ssid_end) return;

    // 提取 SSID
    size_t ssid_len = ssid_end - ssid_start;
    if (ssid_len > 31) ssid_len = 31;

    char ssid[32];
    strncpy(ssid, ssid_start, ssid_len);
    ssid[ssid_len] = '\0';

    // 找到 RSSI (在第一個逗號之後)
    char* rssi_start = strchr(ssid_end, ',');
    if (!rssi_start) return;
    rssi_start++; // 跳過逗號

    int8_t rssi = atoi(rssi_start);

    // 檢查是否已存在
    for (int i = 0; i < wifi_count; i++)
    {
        if (strcmp(wifi_list[i].ssid, ssid) == 0)
        {
            // 更新 RSSI（取較強的）
            if (rssi > wifi_list[i].rssi)
            {
                wifi_list[i].rssi = rssi;
            }
            return;
        }
    }

    // 加入新的 WiFi
    if (wifi_count < MAX_WIFI_COUNT)
    {
        strncpy(wifi_list[wifi_count].ssid, ssid, 31);
        wifi_list[wifi_count].ssid[31] = '\0';
        wifi_list[wifi_count].rssi = rssi;
        wifi_count++;
    }
}

// 顯示 WiFi 列表
void Display_WiFi_List(void)
{
    if (wifi_count == 0)
    {
        #if DEBUG_MODE
            uint8_t msg[] = "No WiFi found\r\n";
            HAL_UART_Transmit(&huart2, msg, sizeof(msg)-1, 100);
        #endif
        return;
    }

    #if DEBUG_MODE
        char msg[128];
        int len = snprintf(msg, sizeof(msg), "\r\n=== WiFi Scan (%d networks) ===\r\n", wifi_count);
        HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);

        for (int i = 0; i < wifi_count; i++)
        {
            len = snprintf(msg, sizeof(msg), "%d. %s: %d dBm\r\n",
                          i+1, wifi_list[i].ssid, wifi_list[i].rssi);
            HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
        }

        uint8_t end[] = "============================\r\n\r\n";
        HAL_UART_Transmit(&huart2, end, sizeof(end)-1, 100);
    #endif
}

// 處理 WiFi 數據
void Process_WiFi_Data(void)
{
    // 將緩衝區轉為字串
    WFBuffer[wf_idx] = '\0';

    // 解析每一行
    char* line_start = (char*)WFBuffer;
    char* line_end;

