Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Src/main.c
    while ((line_end = strchr(line_start, '\n')) != NULL)
    {
        *line_end = '\0'; // 結束當前行

        // 檢查是否為 CWLAP 回應
        if (strstr(line_start, "+CWLAP:") != NULL)
        {
            #if DEBUG_MODE
                char msg[128];
                int len = snprintf(msg, sizeof(msg), "WiFi: %s\r\n", line_start);
                HAL_UART_Transmit(&huart2, (uint8_t*)msg, len, 100);
            #endif

            Parse_WiFi_Line(line_start);
        }
        else if (strstr(line_start, "OK") != NULL)
        {
            // 掃描完成，顯示結果
            Display_WiFi_List();

            // 清空列表準備下次掃描
            wifi_count = 0;
            memset(wifi_list, 0, sizeof(wifi_list));
        }

        line_start = line_end + 1;
    }

    wf_idx = 0;
    memset(WFBuffer, 0, WIFI_BUF_SIZE);
}

void epd_ticket_handler(char *train_type, char *train_kind, char *train_num, char *date, char *dept_time,
						char *dept_sta, char *arr_time, char *arr_sta, char *car, char *seat, char *price)
{   //0 16 32 48 64 80 96 112 128 144 160 176 192 208 224 240 256 272 288 304
	//0 8 16 32 40 48 56 64 72 80 88 96 104 112 120 128 136 144 152 160
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Clear(&hepd, ColorWhite);

	if (strcmp(train_type, "THSR") == 0)  SSD1680_Text(&hepd, 64, 0, "THSR", &cp866_8x16);
	else if (strcmp(train_type, "TRA") == 0)  SSD1680_Text(&hepd, 64, 0, "TRA ", &cp866_8x16);

	if (date != NULL)  SSD1680_Text(&hepd, 0, 16, date, &cp866_8x16);
	if (train_kind != NULL && strcmp(train_type, "TRA") == 0)  SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x16);
	if (train_kind != NULL && (strcmp(train_type, "THSR") == 0)) SSD1680_Text(&hepd, 88, 16, train_kind, &cp866_8x8);
	if (train_num != NULL && (strcmp(train_type, "THSR") == 0))
	{
		if (train_num[0] == '0')  SSD1680_Text(&hepd, 88, 24, train_num + 1, &cp866_8x8);
		else  SSD1680_Text(&hepd, 88, 24, train_num, &cp866_8x8);
	}

	SSD1680_Text(&hepd, 88, 40, "Depart", &cp866_8x14);
	char convert_dept_time[6] = {0};
	convert_dept_time[0] = dept_time[0];
	convert_dept_time[1] = dept_time[1];
	convert_dept_time[2] = ':';
	convert_dept_time[3] = dept_time[2];
	convert_dept_time[4] = dept_time[3];
	convert_dept_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 56, convert_dept_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 40, sta_code_decoder(dept_sta), &cp866_8x16);

	SSD1680_Text(&hepd, 88, 72, "Car", &cp866_8x16);
	if (car[0] == '0') SSD1680_Text(&hepd, 128, 72, car + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 72, car, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 88, "Seat", &cp866_8x16);
	char seat_decoded[4] = {0};
	seat_decoded[0] = seat[0];
	seat_decoded[1] = seat[1];
	switch (seat[4])
	{
		case '1':
			seat_decoded[2] = 'A';
			break;
		case '2':
			seat_decoded[2] = 'B';
			break;
		case '3':
			seat_decoded[2] = 'C';
			break;
		case '4':
			seat_decoded[2] = 'D';
			break;
		case '5':
			seat_decoded[2] = 'E';
			break;
		default:
			seat_decoded[2] = 0;
	}
	seat_decoded[3] = '\0';
	if (seat_decoded[0] == '0')  SSD1680_Text(&hepd, 128, 88, seat_decoded + 1, &cp866_8x16);
	else SSD1680_Text(&hepd, 128, 88, seat_decoded, &cp866_8x16);

	SSD1680_Text(&hepd, 88, 104, "Arrive", &cp866_8x14);
	char convert_arr_time[6] = {0};
	convert_arr_time[0] = arr_time[0];
	convert_arr_time[1] = arr_time[1];
	convert_arr_time[2] = ':';
	convert_arr_time[3] = arr_time[2];
	convert_arr_time[4] = arr_time[3];
	convert_arr_time[5] = '\0';
	SSD1680_Text(&hepd, 88, 118, convert_arr_time, &cp866_8x16);
	SSD1680_Text(&hepd, 8, 112, sta_code_decoder(arr_sta), &cp866_8x16);

	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

void debug_disp(void)
{
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_SET);
	HAL_Delay(100);
	SSD1680_Text(&hepd,  0, 280, "Predict:", &cp866_8x16);
	char predict_str[12];
	sprintf(predict_str, "%d", result);
	SSD1680_Text(&hepd,  72, 280, predict_str, &cp866_8x16);
	SSD1680_Refresh(&hepd, REFRESH_MODE);
	HAL_Delay(1000);
	HAL_GPIO_WritePin(EPD_EN_GPIO_Port, EPD_EN_Pin, GPIO_PIN_RESET);
}

char* sta_code_decoder(char *sta_code)
{
	int sta_code_int = atoi(sta_code);
	switch (sta_code_int)
	{
	    case 1:
	        return "Nangang";
	        break;
	    case 2:
	        return "Taipei";
	        break;
	    case 3:
	        return "Banqiao";
	        break;
	    case 4:
	        return "Taoyuan";
	        break;
	    case 5:
	        return "Hsinchu";
	        break;
	    case 6:
	        return "Miaoli";
	        break;
	    case 7:
	        return "Taichung";
	        break;
	    case 8:
	        return "Changhua";
	        break;
	    case 9:
	        return "Yunlin";
	        break;
	    case 10:
	        return "Chiayi";
	        break;
	    case 11:
	        return "Tainan";
	        break;
	    case 12:
	        return "Zuoying";
	        break;

		case 980:
			return "Nangang";    // 南港
			break;
		case 990:
			return "Songshan";   // 松山
			break;
		case 1000:
			return "Taipei";     // 台北
			break;
		case 1010:
			return "Wanhua";     // 萬華
			break;
		case 1020:
			return "Banqiao";    // 板橋
			break;
		case 1030:
			return "Fuzhou";     // 浮洲
			break;
		case 1040:
			return "Shulin";     // 樹林
			break;
		case 1050:
			return "South Shulin";// 南樹林
			break;
		case 1060:
			return "Shanjia";    // 山佳
			break;
		case 1070:
			return "Yingge";     // 鶯歌
			break;
		case 1080:
			return "Taoyuan";    // 桃園
			break;
		case 1090:
			return "Neili";      // 內壢
			break;
		case 1100:
			return "Zhongli";    // 中壢
			break;
		case 1110:
			return "Puxin";      // 埔心
			break;
		case 1120:
			return "Yangmei";    // 楊梅
			break;
		case 1130:
			return "Fugang";     // 富岡
			break;
		case 1140:
			return "Xinfu";      // 新富
			break;
		case 1150:
			return "Beihu";      // 北湖
			break;
		case 1160:
			return "Hukou";      // 湖口
			break;
		case 1170:
			return "Xinfeng";    // 新豐
			break;
		case 1180:
			return "Zhubei";     // 竹北
			break;
		case 1190:
			return "North Hsinchu"; // 北新竹
			break;
		case 1210:
			return "Hsinchu";    // 新竹
			break;
	    case 3220:
			return "Houli";     // 后里
			break;
		case 3230:
			return "Fengyuan";  // 豐原
			break;
		case 3240:
			return "Lilin";    // 栗林
			break;
		case 3250:
			return "Tanzi";     // 潭子
			break;
		case 3260:
			return "Toujiacuo"; // 頭家厝
			break;
		case 3270:
			return "Songzhu";   // 松竹
			break;
		case 3280:
			return "Taiyuan";   // 太原
			break;
		case 3290:
			return "Jingwu";    // 精武
			break;
		case 3300:
			return "Taichung";  // 台中
			break;
		case 3310:
			return "Wuquan";    // 五權
			break;
		case 3320:
			return "Daqing";    // 大慶
			break;
		case 3330:
			return "Wuri";      // 烏日
			break;
		case 3340:
			return "Xinwuri";   // 新烏日
			break;
		case 3350:
			return "Chenggong"; // 成功
			break;
		case 3360:
			return "Changhua";   // 彰化
			break;
		case 3370:
			return "Huatan";     // 花壇
			break;
		case 3380:
			return "Dacun";      // 大村
			break;
		case 3390:
			return "Yuanlin";    // 員林
			break;
		case 3400:
			return "Yongjing";   // 永靖
			break;
		case 3410:
			return "Shetou";     // 社頭
			break;
		case 3420:
			return "Tianzhong";  // 田中
		case 3430:
			return "Ershui";     // 二水
			break;
		case 3450:
			return "Linnei";     // 林內 (註：台鐵代碼跳過3440)
		case 3460:
			return "Shizeng";    // 石榴
			break;
		case 3470:
			return "Douliu";     // 斗六
			break;
	    default:
	        return sta_code;
	        break;
	}
}

void relu(float *data, int size) {
    for (int i = 0; i < size; i++) {
        if (data[i] < 0.0f) data[i] = 0.0f;
    }
}

void softmax(float *data, int size) {
    float max_val = data[0];
    for (int i = 1; i < size; i++) if (data[i] > max_val) max_val = data[i];
    float sum = 0.0f;
    for (int i = 0; i < size; i++) {
        data[i] = expf(data[i] - max_val);
        sum += data[i];
    }
    for (int i = 0; i < size; i++) data[i] /= sum;
}

int mlp_forward_pass(double current_lat, double current_lon, uint8_t hour_of_day, uint16_t min_of_day, uint8_t day_of_week, int time_to_dept, uint8_t is_ticket_reg, uint8_t is_entering, uint8_t is_exiting)
{
    float x[INPUT_DIM];
    x[0] = current_lat;
    x[1] = current_lon;
    x[2] = (float)hour_of_day;
    x[3] = (float)min_of_day;
    x[4] = (float)day_of_week;
    x[5] = (float)time_to_dept;
    x[6] = (float)is_ticket_reg;
    x[7] = (float)is_entering;
    x[8] = (float)is_exiting;

